Autodesk.Revit.DB.ContFootingTypeSet
A set that contains ContFooting types.

Autodesk.Revit.DB.ContFootingTypeSet.Insert(Autodesk.Revit.DB.ContFootingType)
System.Int32
Insert the specified ContFooting type into the set.
item: The ContFooting type to be inserted into the set.
Returns: Returns whether the ContFooting type was inserted into the set.

Autodesk.Revit.DB.ContFootingTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ContFootingTypeSet.ReverseIterator
Autodesk.Revit.DB.ContFootingTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.ContFootingTypeSet.ForwardIterator
Autodesk.Revit.DB.ContFootingTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ContFootingTypeSet.Erase(Autodesk.Revit.DB.ContFootingType)
System.Int32
Removes a specified ContFooting type from the set.
item: The ContFooting type to be erased.
Returns: The number of ContFooting types that were erased from the set.

Autodesk.Revit.DB.ContFootingTypeSet.Contains(Autodesk.Revit.DB.ContFootingType)
System.Boolean
Tests for the existence of a ContFooting type within the set.
item: The ContFooting type to be searched for.
Returns: The Contains method returns True if the ContFooting type is within the set, otherwise False.

Autodesk.Revit.DB.ContFootingTypeSet.Clear
void
Removes every ContFooting type from the set, rendering it empty.

Autodesk.Revit.DB.ContFootingTypeSet.Size
System.Int32
get
Returns the number of ContFooting types that are in the set.

Autodesk.Revit.DB.ContFootingTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.